; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l33_p33_c33_g33_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	loc19 - location
	loc20 - location
	loc21 - location
	loc22 - location
	loc23 - location
	loc24 - location
	loc25 - location
	loc26 - location
	loc27 - location
	loc28 - location
	loc29 - location
	loc30 - location
	loc31 - location
	loc32 - location
	loc33 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	crate19 - crate
	crate20 - crate
	crate21 - crate
	crate22 - crate
	crate23 - crate
	crate24 - crate
	crate25 - crate
	crate26 - crate
	crate27 - crate
	crate28 - crate
	crate29 - crate
	crate30 - crate
	crate31 - crate
	crate32 - crate
	crate33 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
	person19 - person
	person20 - person
	person21 - person
	person22 - person
	person23 - person
	person24 - person
	person25 - person
	person26 - person
	person27 - person
	person28 - person
	person29 - person
	person30 - person
	person31 - person
	person32 - person
	person33 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(at crate19 depot)
	(at crate20 depot)
	(at crate21 depot)
	(at crate22 depot)
	(at crate23 depot)
	(at crate24 depot)
	(at crate25 depot)
	(at crate26 depot)
	(at crate27 depot)
	(at crate28 depot)
	(at crate29 depot)
	(at crate30 depot)
	(at crate31 depot)
	(at crate32 depot)
	(at crate33 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 food)
	(crate-content crate16 food)
	(crate-content crate17 food)
	(crate-content crate18 medicine)
	(crate-content crate19 medicine)
	(crate-content crate20 medicine)
	(crate-content crate21 medicine)
	(crate-content crate22 medicine)
	(crate-content crate23 medicine)
	(crate-content crate24 medicine)
	(crate-content crate25 medicine)
	(crate-content crate26 medicine)
	(crate-content crate27 medicine)
	(crate-content crate28 medicine)
	(crate-content crate29 medicine)
	(crate-content crate30 medicine)
	(crate-content crate31 medicine)
	(crate-content crate32 medicine)
	(crate-content crate33 medicine)
	(at person1 loc1)
	(at person2 loc31)
	(at person3 loc19)
	(at person4 loc20)
	(at person5 loc28)
	(at person6 loc22)
	(at person7 loc27)
	(at person8 loc7)
	(at person9 loc14)
	(at person10 loc26)
	(at person11 loc13)
	(at person12 loc10)
	(at person13 loc29)
	(at person14 loc1)
	(at person15 loc25)
	(at person16 loc27)
	(at person17 loc10)
	(at person18 loc26)
	(at person19 loc18)
	(at person20 loc8)
	(at person21 loc23)
	(at person22 loc20)
	(at person23 loc8)
	(at person24 loc19)
	(at person25 loc20)
	(at person26 loc17)
	(at person27 loc8)
	(at person28 loc19)
	(at person29 loc23)
	(at person30 loc11)
	(at person31 loc28)
	(at person32 loc4)
	(at person33 loc31)
	(person-needs person2 food)
	(person-needs person4 medicine)
	(person-needs person5 food)
	(person-needs person5 medicine)
	(person-needs person6 medicine)
	(person-needs person7 food)
	(person-needs person8 food)
	(person-needs person9 food)
	(person-needs person11 food)
	(person-needs person12 medicine)
	(person-needs person13 medicine)
	(person-needs person14 medicine)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person17 medicine)
	(person-needs person18 medicine)
	(person-needs person20 food)
	(person-needs person20 medicine)
	(person-needs person22 food)
	(person-needs person22 medicine)
	(person-needs person23 food)
	(person-needs person23 medicine)
	(person-needs person24 medicine)
	(person-needs person26 food)
	(person-needs person28 food)
	(person-needs person28 medicine)
	(person-needs person29 food)
	(person-needs person29 medicine)
	(person-needs person30 food)
	(person-needs person30 medicine)
	(person-needs person31 food)
	(person-needs person31 medicine)
	(person-needs person32 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person2 food)
	(person-has person4 medicine)
	(person-has person5 food)
	(person-has person5 medicine)
	(person-has person6 medicine)
	(person-has person7 food)
	(person-has person8 food)
	(person-has person9 food)
	(person-has person11 food)
	(person-has person12 medicine)
	(person-has person13 medicine)
	(person-has person14 medicine)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person17 medicine)
	(person-has person18 medicine)
	(person-has person20 food)
	(person-has person20 medicine)
	(person-has person22 food)
	(person-has person22 medicine)
	(person-has person23 food)
	(person-has person23 medicine)
	(person-has person24 medicine)
	(person-has person26 food)
	(person-has person28 food)
	(person-has person28 medicine)
	(person-has person29 food)
	(person-has person29 medicine)
	(person-has person30 food)
	(person-has person30 medicine)
	(person-has person31 food)
	(person-has person31 medicine)
	(person-has person32 food)
	))
)

; plan
1. (grab-arm1 drone1 crate31 depot)
   deleted: (arm1-free drone1) (at crate31 depot)
   added: (arm1-load drone1 crate31)
   goals met: 1 of 34
2. (grab-arm2 drone1 crate30 depot)
   deleted: (arm2-free drone1) (at crate30 depot)
   added: (arm2-load drone1 crate30)
   goals met: 1 of 34
3. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 0 of 34
4. (deliver-arm2 drone1 person5 crate30 medicine loc28)
   deleted: (arm2-load drone1 crate30) (person-needs person5 medicine)
   added: (arm2-free drone1) (person-has person5 medicine)
   goals met: 1 of 34
5. (move-drone drone1 loc28 depot)
   deleted: (at drone1 loc28)
   added: (at drone1 depot)
   goals met: 2 of 34
6. (grab-arm2 drone1 crate20 depot)
   deleted: (arm2-free drone1) (at crate20 depot)
   added: (arm2-load drone1 crate20)
   goals met: 2 of 34
7. (move-drone drone1 depot loc22)
   deleted: (at drone1 depot)
   added: (at drone1 loc22)
   goals met: 1 of 34
8. (deliver-arm2 drone1 person6 crate20 medicine loc22)
   deleted: (arm2-load drone1 crate20) (person-needs person6 medicine)
   added: (arm2-free drone1) (person-has person6 medicine)
   goals met: 2 of 34
9. (move-drone drone1 loc22 depot)
   deleted: (at drone1 loc22)
   added: (at drone1 depot)
   goals met: 3 of 34
10. (grab-arm2 drone1 crate33 depot)
   deleted: (arm2-free drone1) (at crate33 depot)
   added: (arm2-load drone1 crate33)
   goals met: 3 of 34
11. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 2 of 34
12. (deliver-arm2 drone1 person12 crate33 medicine loc10)
   deleted: (arm2-load drone1 crate33) (person-needs person12 medicine)
   added: (arm2-free drone1) (person-has person12 medicine)
   goals met: 3 of 34
13. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 4 of 34
14. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 4 of 34
15. (move-drone drone1 depot loc29)
   deleted: (at drone1 depot)
   added: (at drone1 loc29)
   goals met: 3 of 34
16. (deliver-arm2 drone1 person13 crate18 medicine loc29)
   deleted: (arm2-load drone1 crate18) (person-needs person13 medicine)
   added: (arm2-free drone1) (person-has person13 medicine)
   goals met: 4 of 34
17. (move-drone drone1 loc29 depot)
   deleted: (at drone1 loc29)
   added: (at drone1 depot)
   goals met: 5 of 34
18. (grab-arm2 drone1 crate29 depot)
   deleted: (arm2-free drone1) (at crate29 depot)
   added: (arm2-load drone1 crate29)
   goals met: 5 of 34
19. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 4 of 34
20. (deliver-arm2 drone1 person14 crate29 medicine loc1)
   deleted: (arm2-load drone1 crate29) (person-needs person14 medicine)
   added: (arm2-free drone1) (person-has person14 medicine)
   goals met: 5 of 34
21. (move-drone drone1 loc1 loc27)
   deleted: (at drone1 loc1)
   added: (at drone1 loc27)
   goals met: 5 of 34
22. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 6 of 34
23. (grab-arm2 drone1 crate27 depot)
   deleted: (arm2-free drone1) (at crate27 depot)
   added: (arm2-load drone1 crate27)
   goals met: 6 of 34
24. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 5 of 34
25. (deliver-arm2 drone1 person17 crate27 medicine loc10)
   deleted: (arm2-load drone1 crate27) (person-needs person17 medicine)
   added: (arm2-free drone1) (person-has person17 medicine)
   goals met: 6 of 34
26. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 7 of 34
27. (grab-arm2 drone1 crate25 depot)
   deleted: (arm2-free drone1) (at crate25 depot)
   added: (arm2-load drone1 crate25)
   goals met: 7 of 34
28. (move-drone drone1 depot loc26)
   deleted: (at drone1 depot)
   added: (at drone1 loc26)
   goals met: 6 of 34
29. (deliver-arm2 drone1 person18 crate25 medicine loc26)
   deleted: (arm2-load drone1 crate25) (person-needs person18 medicine)
   added: (arm2-free drone1) (person-has person18 medicine)
   goals met: 7 of 34
30. (move-drone drone1 loc26 depot)
   deleted: (at drone1 loc26)
   added: (at drone1 depot)
   goals met: 8 of 34
31. (grab-arm2 drone1 crate22 depot)
   deleted: (arm2-free drone1) (at crate22 depot)
   added: (arm2-load drone1 crate22)
   goals met: 8 of 34
32. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 7 of 34
33. (deliver-arm2 drone1 person20 crate22 medicine loc8)
   deleted: (arm2-load drone1 crate22) (person-needs person20 medicine)
   added: (arm2-free drone1) (person-has person20 medicine)
   goals met: 8 of 34
34. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 9 of 34
35. (grab-arm2 drone1 crate24 depot)
   deleted: (arm2-free drone1) (at crate24 depot)
   added: (arm2-load drone1 crate24)
   goals met: 9 of 34
36. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 8 of 34
37. (deliver-arm2 drone1 person22 crate24 medicine loc20)
   deleted: (arm2-load drone1 crate24) (person-needs person22 medicine)
   added: (arm2-free drone1) (person-has person22 medicine)
   goals met: 9 of 34
38. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 10 of 34
39. (grab-arm2 drone1 crate26 depot)
   deleted: (arm2-free drone1) (at crate26 depot)
   added: (arm2-load drone1 crate26)
   goals met: 10 of 34
40. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 9 of 34
41. (deliver-arm2 drone1 person23 crate26 medicine loc8)
   deleted: (arm2-load drone1 crate26) (person-needs person23 medicine)
   added: (arm2-free drone1) (person-has person23 medicine)
   goals met: 10 of 34
42. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 11 of 34
43. (grab-arm2 drone1 crate23 depot)
   deleted: (arm2-free drone1) (at crate23 depot)
   added: (arm2-load drone1 crate23)
   goals met: 11 of 34
44. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 10 of 34
45. (deliver-arm2 drone1 person24 crate23 medicine loc19)
   deleted: (arm2-load drone1 crate23) (person-needs person24 medicine)
   added: (arm2-free drone1) (person-has person24 medicine)
   goals met: 11 of 34
46. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 12 of 34
47. (grab-arm2 drone1 crate21 depot)
   deleted: (arm2-free drone1) (at crate21 depot)
   added: (arm2-load drone1 crate21)
   goals met: 12 of 34
48. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 11 of 34
49. (deliver-arm2 drone1 person28 crate21 medicine loc19)
   deleted: (arm2-load drone1 crate21) (person-needs person28 medicine)
   added: (arm2-free drone1) (person-has person28 medicine)
   goals met: 12 of 34
50. (move-drone drone1 loc19 depot)
   deleted: (at drone1 loc19)
   added: (at drone1 depot)
   goals met: 13 of 34
51. (grab-arm2 drone1 crate28 depot)
   deleted: (arm2-free drone1) (at crate28 depot)
   added: (arm2-load drone1 crate28)
   goals met: 13 of 34
52. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 12 of 34
53. (deliver-arm2 drone1 person29 crate28 medicine loc23)
   deleted: (arm2-load drone1 crate28) (person-needs person29 medicine)
   added: (arm2-free drone1) (person-has person29 medicine)
   goals met: 13 of 34
54. (move-drone drone1 loc23 depot)
   deleted: (at drone1 loc23)
   added: (at drone1 depot)
   goals met: 14 of 34
55. (grab-arm2 drone1 crate19 depot)
   deleted: (arm2-free drone1) (at crate19 depot)
   added: (arm2-load drone1 crate19)
   goals met: 14 of 34
56. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 13 of 34
57. (deliver-arm2 drone1 person30 crate19 medicine loc11)
   deleted: (arm2-load drone1 crate19) (person-needs person30 medicine)
   added: (arm2-free drone1) (person-has person30 medicine)
   goals met: 14 of 34
58. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 15 of 34
59. (grab-arm2 drone1 crate32 depot)
   deleted: (arm2-free drone1) (at crate32 depot)
   added: (arm2-load drone1 crate32)
   goals met: 15 of 34
60. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 14 of 34
61. (deliver-arm2 drone1 person31 crate32 medicine loc28)
   deleted: (arm2-load drone1 crate32) (person-needs person31 medicine)
   added: (arm2-free drone1) (person-has person31 medicine)
   goals met: 15 of 34
62. (move-drone drone1 loc28 depot)
   deleted: (at drone1 loc28)
   added: (at drone1 depot)
   goals met: 16 of 34
63. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 15 of 34
64. (deliver-arm1 drone1 person4 crate31 medicine loc20)
   deleted: (arm1-load drone1 crate31) (person-needs person4 medicine)
   added: (arm1-free drone1) (person-has person4 medicine)
   goals met: 16 of 34
65. (move-drone drone1 loc20 depot)
   deleted: (at drone1 loc20)
   added: (at drone1 depot)
   goals met: 17 of 34
66. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 17 of 34
67. (grab-arm2 drone1 crate16 depot)
   deleted: (arm2-free drone1) (at crate16 depot)
   added: (arm2-load drone1 crate16)
   goals met: 17 of 34
68. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 16 of 34
69. (deliver-arm1 drone1 person20 crate17 food loc8)
   deleted: (arm1-load drone1 crate17) (person-needs person20 food)
   added: (arm1-free drone1) (person-has person20 food)
   goals met: 17 of 34
70. (move-drone drone1 loc8 loc14)
   deleted: (at drone1 loc8)
   added: (at drone1 loc14)
   goals met: 17 of 34
71. (deliver-arm2 drone1 person9 crate16 food loc14)
   deleted: (arm2-load drone1 crate16) (person-needs person9 food)
   added: (arm2-free drone1) (person-has person9 food)
   goals met: 18 of 34
72. (move-drone drone1 loc14 depot)
   deleted: (at drone1 loc14)
   added: (at drone1 depot)
   goals met: 19 of 34
73. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 19 of 34
74. (grab-arm2 drone1 crate14 depot)
   deleted: (arm2-free drone1) (at crate14 depot)
   added: (arm2-load drone1 crate14)
   goals met: 19 of 34
75. (move-drone drone1 depot loc20)
   deleted: (at drone1 depot)
   added: (at drone1 loc20)
   goals met: 18 of 34
76. (deliver-arm1 drone1 person22 crate11 food loc20)
   deleted: (arm1-load drone1 crate11) (person-needs person22 food)
   added: (arm1-free drone1) (person-has person22 food)
   goals met: 19 of 34
77. (move-drone drone1 loc20 loc13)
   deleted: (at drone1 loc20)
   added: (at drone1 loc13)
   goals met: 19 of 34
78. (deliver-arm2 drone1 person11 crate14 food loc13)
   deleted: (arm2-load drone1 crate14) (person-needs person11 food)
   added: (arm2-free drone1) (person-has person11 food)
   goals met: 20 of 34
79. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 21 of 34
80. (grab-arm1 drone1 crate7 depot)
   deleted: (arm1-free drone1) (at crate7 depot)
   added: (arm1-load drone1 crate7)
   goals met: 21 of 34
81. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 20 of 34
82. (deliver-arm1 drone1 person23 crate7 food loc8)
   deleted: (arm1-load drone1 crate7) (person-needs person23 food)
   added: (arm1-free drone1) (person-has person23 food)
   goals met: 21 of 34
83. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 22 of 34
84. (grab-arm1 drone1 crate1 depot)
   deleted: (arm1-free drone1) (at crate1 depot)
   added: (arm1-load drone1 crate1)
   goals met: 22 of 34
85. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 21 of 34
86. (deliver-arm1 drone1 person5 crate1 food loc28)
   deleted: (arm1-load drone1 crate1) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 22 of 34
87. (move-drone drone1 loc28 depot)
   deleted: (at drone1 loc28)
   added: (at drone1 depot)
   goals met: 23 of 34
88. (grab-arm1 drone1 crate10 depot)
   deleted: (arm1-free drone1) (at crate10 depot)
   added: (arm1-load drone1 crate10)
   goals met: 23 of 34
89. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 23 of 34
90. (move-drone drone1 depot loc7)
   deleted: (at drone1 depot)
   added: (at drone1 loc7)
   goals met: 22 of 34
91. (deliver-arm1 drone1 person8 crate10 food loc7)
   deleted: (arm1-load drone1 crate10) (person-needs person8 food)
   added: (arm1-free drone1) (person-has person8 food)
   goals met: 23 of 34
92. (move-drone drone1 loc7 loc17)
   deleted: (at drone1 loc7)
   added: (at drone1 loc17)
   goals met: 23 of 34
93. (deliver-arm2 drone1 person26 crate3 food loc17)
   deleted: (arm2-load drone1 crate3) (person-needs person26 food)
   added: (arm2-free drone1) (person-has person26 food)
   goals met: 24 of 34
94. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 25 of 34
95. (grab-arm2 drone1 crate8 depot)
   deleted: (arm2-free drone1) (at crate8 depot)
   added: (arm2-load drone1 crate8)
   goals met: 25 of 34
96. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 25 of 34
97. (move-drone drone1 depot loc19)
   deleted: (at drone1 depot)
   added: (at drone1 loc19)
   goals met: 24 of 34
98. (deliver-arm2 drone1 person28 crate8 food loc19)
   deleted: (arm2-load drone1 crate8) (person-needs person28 food)
   added: (arm2-free drone1) (person-has person28 food)
   goals met: 25 of 34
99. (move-drone drone1 loc19 loc31)
   deleted: (at drone1 loc19)
   added: (at drone1 loc31)
   goals met: 25 of 34
100. (deliver-arm1 drone1 person2 crate6 food loc31)
   deleted: (arm1-load drone1 crate6) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 26 of 34
101. (move-drone drone1 loc31 depot)
   deleted: (at drone1 loc31)
   added: (at drone1 depot)
   goals met: 27 of 34
102. (grab-arm1 drone1 crate5 depot)
   deleted: (arm1-free drone1) (at crate5 depot)
   added: (arm1-load drone1 crate5)
   goals met: 27 of 34
103. (grab-arm2 drone1 crate2 depot)
   deleted: (arm2-free drone1) (at crate2 depot)
   added: (arm2-load drone1 crate2)
   goals met: 27 of 34
104. (move-drone drone1 depot loc23)
   deleted: (at drone1 depot)
   added: (at drone1 loc23)
   goals met: 26 of 34
105. (deliver-arm1 drone1 person29 crate5 food loc23)
   deleted: (arm1-load drone1 crate5) (person-needs person29 food)
   added: (arm1-free drone1) (person-has person29 food)
   goals met: 27 of 34
106. (move-drone drone1 loc23 loc27)
   deleted: (at drone1 loc23)
   added: (at drone1 loc27)
   goals met: 27 of 34
107. (deliver-arm2 drone1 person16 crate2 food loc27)
   deleted: (arm2-load drone1 crate2) (person-needs person16 food)
   added: (arm2-free drone1) (person-has person16 food)
   goals met: 28 of 34
108. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 29 of 34
109. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 29 of 34
110. (move-drone drone1 depot loc11)
   deleted: (at drone1 depot)
   added: (at drone1 loc11)
   goals met: 28 of 34
111. (deliver-arm2 drone1 person30 crate13 food loc11)
   deleted: (arm2-load drone1 crate13) (person-needs person30 food)
   added: (arm2-free drone1) (person-has person30 food)
   goals met: 29 of 34
112. (move-drone drone1 loc11 depot)
   deleted: (at drone1 loc11)
   added: (at drone1 depot)
   goals met: 30 of 34
113. (grab-arm2 drone1 crate12 depot)
   deleted: (arm2-free drone1) (at crate12 depot)
   added: (arm2-load drone1 crate12)
   goals met: 30 of 34
114. (move-drone drone1 depot loc10)
   deleted: (at drone1 depot)
   added: (at drone1 loc10)
   goals met: 29 of 34
115. (deliver-arm2 drone1 person17 crate12 food loc10)
   deleted: (arm2-load drone1 crate12) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 30 of 34
116. (move-drone drone1 loc10 depot)
   deleted: (at drone1 loc10)
   added: (at drone1 depot)
   goals met: 31 of 34
117. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 31 of 34
118. (move-drone drone1 depot loc28)
   deleted: (at drone1 depot)
   added: (at drone1 loc28)
   goals met: 30 of 34
119. (deliver-arm2 drone1 person31 crate4 food loc28)
   deleted: (arm2-load drone1 crate4) (person-needs person31 food)
   added: (arm2-free drone1) (person-has person31 food)
   goals met: 31 of 34
120. (move-drone drone1 loc28 depot)
   deleted: (at drone1 loc28)
   added: (at drone1 depot)
   goals met: 32 of 34
121. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 32 of 34
122. (move-drone drone1 depot loc27)
   deleted: (at drone1 depot)
   added: (at drone1 loc27)
   goals met: 31 of 34
123. (deliver-arm2 drone1 person7 crate9 food loc27)
   deleted: (arm2-load drone1 crate9) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 32 of 34
124. (move-drone drone1 loc27 depot)
   deleted: (at drone1 loc27)
   added: (at drone1 depot)
   goals met: 33 of 34
125. (grab-arm2 drone1 crate15 depot)
   deleted: (arm2-free drone1) (at crate15 depot)
   added: (arm2-load drone1 crate15)
   goals met: 33 of 34
126. (move-drone drone1 depot loc9)
   deleted: (at drone1 depot)
   added: (at drone1 loc9)
   goals met: 32 of 34
127. (move-drone drone1 loc9 loc4)
   deleted: (at drone1 loc9)
   added: (at drone1 loc4)
   goals met: 32 of 34
128. (deliver-arm2 drone1 person32 crate15 food loc4)
   deleted: (arm2-load drone1 crate15) (person-needs person32 food)
   added: (arm2-free drone1) (person-has person32 food)
   goals met: 33 of 34
129. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 34 of 34
